---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.ReinforcementBarOrientation.FarSide
enum: Autodesk.Revit.DB.Structure.ReinforcementBarOrientation
source: html/b67e1240-752a-316d-0e41-2000d19aa088.htm
---
# Autodesk.Revit.DB.Structure.ReinforcementBarOrientation.FarSide

The major segment of the bar is on the side edge far from the Path Reinforcement sketch line.